Revit 2026 API

# EnergyDataSettingsIsExportShadingSurfacesEnabled Property

---

Indicates if "shading surfaces" are included in GreenBuildingXML export of the detailed model.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsExportShadingSurfacesEnabled { get; }
```
```vb
Public ReadOnly Property IsExportShadingSurfacesEnabled As Boolean
	Get
```
```cpp
public:
property bool IsExportShadingSurfacesEnabled {
	bool get ();
}
```
```fsharp
member IsExportShadingSurfacesEnabled : bool with get
```

#### Property Value

Boolean

Result is based on the ExportComplexity setting. The method described by gbs/gbxml.org to calculate the shading surfaces is to take all surfaces from the MEP spaces, subtract them from the surfaces from all building elements, and then the remaining surfaces are considered to be the shading surfaces.

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace